{
  "1.0.0": {
    "en": "New app"
  },
  "1.0.1": {
    "en": "bug fix"
  },
  "1.0.2": {
    "en": "Removed CS translations for certification, changes in API calls"
  },
  "1.0.3": {
    "en": "API changes"
  },
  "1.0.4": {
    "en": "Added community topic in forum"
  },
  "1.1.0": {
    "en": "New capability - daily average price, new trigger - price for x hours is highest/lowest for the day"
  },
  "1.1.1": {
    "en": "AND card, text corrections"
  },
  "1.0.5": {
    "en": "new trigger - when api fails, widgets for testing"
  },
  "1.0.6": {
    "en": "Fixed api fail trigger"
  },
  "1.0.7": {
    "en": "fixed device values when api fails, fixed error trigger"
  },
  "1.0.8": {
    "en": "minor fix"
  },
  "1.2.0": {
    "en": "Fixed new WHEN and AND cards, removed extra development log"
  },
  "1.2.1": {
    "en": "Added widgets"
  },
  "1.2.2": {
    "en": "Added WHEN current price changes"
  },
  "1.2.4": {
    "en": "fixed widgets"
  },
  "1.2.5": {
    "en": "Updated widget"
  },
  "1.2.6": {
    "en": "Fixed WHEN price changed card"
  },
  "1.2.7": {
    "en": "Minor fixes thx to Michal Stranik"
  },
  "1.2.8": {
    "en": "Fixed timezone issue on current price, added new flow cards"
  },
  "1.2.9": {
    "en": "fixed today price widget with negative prices"
  },
  "1.2.11": {
    "en": "Users now can set how many hour are in high/low price index."
  },
  "1.2.12": {
    "en": "Changes in today spot price widget"
  },
  "1.2.13": {
    "en": "Updated today price widget - more compact, highlighted current hour bar, color scheme is now based on high/low price index settings in device settings"
  },
  "1.2.14": {
    "en": "Optimized widgets, removed logs"
  },
  "1.2.15": {
    "en": "fixed current spot price widget"
  },
  "1.2.16": {
    "en": "Ability to change price to kWh in device settings"
  },
  "2.0.0": {
    "en": "Major API Refactor - Added backup API (ote-cr) and modified the method for updating capabilities. The app no longer calls the API for the current price; instead, it calculates it based on time and capability. This change removes the need to call the API for current price data. In line with this update, the WHEN API call fails card has also been modified to trigger only if both primary and backup API calls fail. This change significantly improves data stability. However, please note that it may cause breaking changes—check your flows accordingly. Additionally, prices and indices for individual hours have been removed from the UI (they remain available in insights and for use in flows). The UI now only shows the current price, current index, and daily average. You can also use a widget to display a complete daily price chart if desired."
  },
  "2.0.1": {
    "en": "fix in trigger card"
  },
  "2.0.2": {
    "en": "small fix"
  },
  "2.0.3": {
    "en": "fixed widgets"
  },
  "2.0.4": {
    "en": "Fixed tarif change trigger"
  },
  "2.0.5": {
    "en": "The code is now complete and includes all the required features, including: An exponential retry mechanism for updates Price validation (including negative values) An improved API failure trigger with retry information Proper cleanup of timeouts and intervals All necessary flow cards and their handlers"
  },
  "2.0.6": {
    "en": "fixed trigger and condition cards with average for x hours. Added tokens for this trigger card and for api fail trigger."
  },
  "2.0.7": {
    "en": "removed logs"
  },
  "2.0.8": {
    "en": "Fixed issues with time and update current price capability"
  },
  "2.0.9": {
    "en": "Added device timeline with API information, fixed update data flow card, unhide daily prices in device detail - till widgets go public"
  },
  "2.0.10": {
    "en": "fixed timeline for midninght api call"
  },
  "2.0.11": {
    "en": "Bugfix"
  },
  "2.0.12": {
    "en": "bugfix"
  }
}
